OpenFOAM/cases/ico20860-fcyl10-a/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 1);
        // value           uniform (0 0 1); // Not in cylinder example
    }
    outlet
    {
        type            pressureInletOutletVelocity;
	inletValue	uniform (0 0 1); // Included in cylinder example
        value           uniform (0 0 1);
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
